// 다차원 배열 (multidimensional array)

let twoDimensional = [[1, 2], [3,4]];  // 2차원 배열
console.log(twoDimensional[0]);
console.log(twoDimensional[0][1]);


let myFridge = [
  ['콜라', '사이다', '환타'],
  ['치즈', '우유', '버터'],
  ['계란', '우유', '버터'],
];

let otherFridge = {
  fridge: {
    '채소층': ['양상추', '당근', '파'],
    '과일층': ['사과', '바나나', '딸기'],
    '고기층': ['돼지고기', '소고기', '닭고기'],
    '음료층': ['콜라', '사이다', '환타'],
  },
  freezer: {
    '얼음층': ['얼음'],
    '아이스크림층': ['찰떡아이스', '투게더', '빙수'],
  }
};

let mailbox = [
  [101, 201, 301],
  [102, 202, 302],
  [103, 203, 303],
];

let chessBoard = [
  ['♜', '♞', '♝', '♛', '♚', '♝', '♞', '♜'],
  ['♟', '♟', '♟', '♟', '♟', '♟', '♟', '♟'],
  ['', '', '', '', '', '', '', ''],
  ['', '', '', '', '', '', '', ''],
  ['♟', '♟', '♟', '♟', '♟', '♟', '♟', '♟'],
  ['♜', '♞', '♝', '♛', '♚', '♝', '♞', '♜'],
];


